# FenceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDiagramSettings..::..FenceType Property
AnalysisDisplayDiagramSettings Class See Also
---
Type of diagram fence visualization.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisDisplayStyleDiagramFenceType FenceType { get; set; }
```

Visual Basic
---
```text
Public Property FenceType As AnalysisDisplayStyleDiagramFenceType
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisDisplayStyleDiagramFenceType FenceType {
	AnalysisDisplayStyleDiagramFenceType get ();
	void set (AnalysisDisplayStyleDiagramFenceType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace